#include <stdio.h>

int main() { 
	
	printf("Пункт 4: сравнение кодов символов\n\n"); 

	/* цифры 0-9*/
	printf ("1) цифры '0'-'9': \n");
	printf ("Коды символов: \n");
	for (char c='0'; c<= '9'; c++) {
		printf (" '%c' = %d", c, c);
	}
	printf("\n Порядок: ");
	for (char c='0'; c<='9'; c++) {
		printf("%c", c);
	}
	printf("\n\n");
        
	/*строчные буквы a-z*/
	printf("2) строчные буквы 'a'-'z': \n");
	printf(" Коды символов: ");
	for (char c='a'; c<= 'z'; c++) {
		printf(" '%c'=%d", c, c);
	}
	printf("\n Порядок: ");
	for (char c='a'; c<='z'; c++) {
		printf("%c", c);
	}
	printf("\n\n");

	/*заглавные буквы A-Z*/
	printf("3) заглавные буквы 'A'-'Z': \n");
	printf(" Коды символов: ");
	for (char c='A'; c<= 'Z'; c++) {
		printf(" '%c'=%d", c, c);
	}
	printf("\n Порядок: ");
	for (char c = 'A'; c <= 'Z'; c++) {
		printf("%c", c);
	}
	printf("\n\n");

	/*пробел*/
	printf ("4) пробел: \n");
	printf( " Код пробела: ' '=%d\n\n", ' ');
	
	/*сравнение кодов между собой*/
	printf("5) сравнение кодов между собой: \n");
	printf(" '0' = %d, '9' = %d\n", '0', '9');
	printf(" 'A' = %d, 'Z' = %d\n", 'A', 'Z');
	printf(" 'a' = %d, 'z' = %d\n", 'a', 'z');
	printf(" ' ' = %d\n\n", ' ');

	/*сравнение кодов относительно друг друга*/
	printf("6) сравнение кодов относительно друг друга: \n");
	printf(" цифры < заглавные: %s\n", ('0' < 'A') ? "да" : "нет");
	printf(" заглавные < строчные: %s\n", ('Z' < 'a') ? "да" : "нет");
	printf(" пробел < цифра '0': %s\n", (' ' < 'a') ? "да" : "нет");
	printf(" пробел < буква 'A': %s\n", (' ' < 'A') ? "да" : "нет");
	printf(" пробел < буква 'a': %s\n\n", (' ' < 'a') ? "да" : "нет");


	return 0;
}
